   - [#   1] AOD simple: 
--------------------------------------------------------------------------------
  36:         
  37:         return i
  38:     
  39:     def last_two(self, x):
- 40:         return x[-2:]
+ 40:         return x[2:]
  41:     
  42:     def empty_string(self):
  43:         return ''
  44:     
--------------------------------------------------------------------------------
<TIMESTAMP> survived

   - [#   2] AOD simple: 
--------------------------------------------------------------------------------
  62:     def get_magic(self):
  63:         return self.z
  64:     
  65:     def negate_number(self, x):
- 66:         return -x
+ 66:         return x
  67:     
  68:     def negate_bool(self, x):
  69:         return not x
  70:     
--------------------------------------------------------------------------------
<TIMESTAMP> killed by test_negate_number (simple_good_test.SimpleGoodTest.test_negate_number)

Traceback (most recent call last):
  File "/app/example/test/simple_good_test.py", line 48, in test_negate_number
    self.assertEqual(self.simple.negate_number(10), -10)
AssertionError: 10 != -10

   - [#   3] AOR simple: 
--------------------------------------------------------------------------------
  19:     def __init__(self, z):
  20:         self.z = z
  21:     
  22:     def add(self, x, y):
- 23:         return x + y
+ 23:         return x - y
  24:     
  25:     def add_two(self, x):
  26:         return self.add(x, 2)
  27:     
--------------------------------------------------------------------------------
<TIMESTAMP> killed by test_add (simple_good_test.SimpleGoodTest.test_add)

Traceback (most recent call last):
  File "/app/example/test/simple_good_test.py", line 11, in test_add
    self.assertEqual(self.simple.add(2, 2), 4)
AssertionError: 0 != 4

   - [#   4] AOR simple: 
--------------------------------------------------------------------------------
  25:     def add_two(self, x):
  26:         return self.add(x, 2)
  27:     
  28:     def add_etc(self, x):
- 29:         return x + ' etc.'
+ 29:         return x - ' etc.'
  30:     
  31:     def loop(self):
  32:         i = 0
  33:         
--------------------------------------------------------------------------------
<TIMESTAMP> timeout

   - [#   5] AOR simple: 
--------------------------------------------------------------------------------
  36:         
  37:         return i
  38:     
  39:     def last_two(self, x):
- 40:         return x[-2:]
+ 40:         return x[+2:]
  41:     
  42:     def empty_string(self):
  43:         return ''
  44:     
--------------------------------------------------------------------------------
<TIMESTAMP> survived

   - [#   6] AOR simple: 
--------------------------------------------------------------------------------
  46:     @notmutate
  47:     def equivalent(self, x):return x[-1:-1:-1]
  48:     
  49:     def is_odd(self, x):
- 50:         if x % 2:
+ 50:         if x * 2:
  51:             return True
  52:         return False
  53:     
  54:     
--------------------------------------------------------------------------------
<TIMESTAMP> killed by test_is_not_odd (simple_good_test.SimpleGoodTest.test_is_not_odd)

Traceback (most recent call last):
  File "/app/example/test/simple_good_test.py", line 45, in test_is_not_odd
    self.assertFalse(self.simple.is_odd(2))
AssertionError: True is not false

   - [#   7] AOR simple: 
--------------------------------------------------------------------------------
  56:     def get_const():return 1337
  57:     
  58:     
  59:     @classmethod
- 60:     def get_inc_const(cls):return cls.get_const() + 1
+ 60:     def get_inc_const(cls):return cls.get_const() - 1
  61:     
  62:     def get_magic(self):
  63:         return self.z
  64:     
--------------------------------------------------------------------------------
<TIMESTAMP> killed by test_get_inc_const (simple_good_test.SimpleGoodTest.test_get_inc_const)

Traceback (most recent call last):
  File "/app/example/test/simple_good_test.py", line 35, in test_get_inc_const
    self.assertEqual(self.simple.get_inc_const(), 1338)
AssertionError: 1336 != 1338

   - [#   8] AOR simple: 
--------------------------------------------------------------------------------
  62:     def get_magic(self):
  63:         return self.z
  64:     
  65:     def negate_number(self, x):
- 66:         return -x
+ 66:         return +x
  67:     
  68:     def negate_bool(self, x):
  69:         return not x
  70:     
--------------------------------------------------------------------------------
<TIMESTAMP> killed by test_negate_number (simple_good_test.SimpleGoodTest.test_negate_number)

Traceback (most recent call last):
  File "/app/example/test/simple_good_test.py", line 48, in test_negate_number
    self.assertEqual(self.simple.negate_number(10), -10)
AssertionError: 10 != -10

   - [#   9] ASR simple: 
--------------------------------------------------------------------------------
  31:     def loop(self):
  32:         i = 0
  33:         
  34:         while i != 100:
- 35:             i += 1
+ 35:             i -= 1
  36:         
  37:         return i
  38:     
  39:     def last_two(self, x):
--------------------------------------------------------------------------------
<TIMESTAMP> timeout

   - [#  10] ASR simple: 
--------------------------------------------------------------------------------
  81:         return 2
  82:     
  83:     def bar(self):
  84:         super().bar()
- 85:         self.x += 1
+ 85:         self.x -= 1
  86:     
  87:     def handle_exception(self):
  88:         try:
  89:             raise AttributeError
--------------------------------------------------------------------------------
<TIMESTAMP> killed by test_overridden_call (simple_good_test.SimpleGoodTest.test_overridden_call)

Traceback (most recent call last):
  File "/app/example/test/simple_good_test.py", line 68, in test_overridden_call
    self.assertEqual(self.simple.x, 2)
AssertionError: 0 != 2

   - [#  11] COD simple: 
--------------------------------------------------------------------------------
  65:     def negate_number(self, x):
  66:         return -x
  67:     
  68:     def negate_bool(self, x):
- 69:         return not x
+ 69:         return x
  70:     
  71:     def negate_bitwise(self, x):
  72:         return ~x
  73:     
--------------------------------------------------------------------------------
<TIMESTAMP> killed by test_negate_bool (simple_good_test.SimpleGoodTest.test_negate_bool)

Traceback (most recent call last):
  File "/app/example/test/simple_good_test.py", line 51, in test_negate_bool
    self.assertEqual(self.simple.negate_bool(True), False)
AssertionError: True != False

   - [#  12] COI simple: 
--------------------------------------------------------------------------------
  30:     
  31:     def loop(self):
  32:         i = 0
  33:         
- 34:         while i != 100:
+ 34:         while not (i != 100):
  35:             i += 1
  36:         
  37:         return i
  38:     
--------------------------------------------------------------------------------
<TIMESTAMP> killed by test_loop (simple_good_test.SimpleGoodTest.test_loop)

Traceback (most recent call last):
  File "/app/example/test/simple_good_test.py", line 23, in test_loop
    self.assertEqual(self.simple.loop(), 100)
AssertionError: 0 != 100

   - [#  13] COI simple: 
--------------------------------------------------------------------------------
  46:     @notmutate
  47:     def equivalent(self, x):return x[-1:-1:-1]
  48:     
  49:     def is_odd(self, x):
- 50:         if x % 2:
+ 50:         if not (x % 2):
  51:             return True
  52:         return False
  53:     
  54:     
--------------------------------------------------------------------------------
<TIMESTAMP> killed by test_is_not_odd (simple_good_test.SimpleGoodTest.test_is_not_odd)

Traceback (most recent call last):
  File "/app/example/test/simple_good_test.py", line 45, in test_is_not_odd
    self.assertFalse(self.simple.is_odd(2))
AssertionError: True is not false

   - [#  32] DDL simple: 
--------------------------------------------------------------------------------
  51:             return True
  52:         return False
  53:     
  54:     
- 55:     @staticmethod
- 56:     def get_const():return 1337
+ 55:     def get_const():
+ 56:         return 1337
  57:     
  58:     
  59:     @classmethod
  60:     def get_inc_const(cls):return cls.get_const() + 1
--------------------------------------------------------------------------------
<TIMESTAMP> timeout

   - [#  33] DDL simple: 
--------------------------------------------------------------------------------
  55:     @staticmethod
  56:     def get_const():return 1337
  57:     
  58:     
- 59:     @classmethod
- 60:     def get_inc_const(cls):return cls.get_const() + 1
+ 59:     def get_inc_const(cls):
+ 60:         return cls.get_const() + 1
  61:     
  62:     def get_magic(self):
  63:         return self.z
  64:     
--------------------------------------------------------------------------------
<TIMESTAMP> timeout

   - [#  41] LCR simple: 
--------------------------------------------------------------------------------
  71:     def negate_bitwise(self, x):
  72:         return ~x
  73:     
  74:     def bool_conjunction(self, a, b):
- 75:         return (a or b)
+ 75:         return (a and b)
  76:     
  77:     def bitwise_conjunction(self, a, b):
  78:         return a | b
  79:     
--------------------------------------------------------------------------------
<TIMESTAMP> killed by test_bool_conjunction (simple_good_test.SimpleGoodTest.test_bool_conjunction)

Traceback (most recent call last):
  File "/app/example/test/simple_good_test.py", line 57, in test_bool_conjunction
    self.assertEqual(self.simple.bool_conjunction(True, False), True)
AssertionError: False != True

   - [#  42] LOD simple: 
--------------------------------------------------------------------------------
  68:     def negate_bool(self, x):
  69:         return not x
  70:     
  71:     def negate_bitwise(self, x):
- 72:         return ~x
+ 72:         return x
  73:     
  74:     def bool_conjunction(self, a, b):
  75:         return (a or b)
  76:     
--------------------------------------------------------------------------------
<TIMESTAMP> killed by test_negate_bitwise (simple_good_test.SimpleGoodTest.test_negate_bitwise)

Traceback (most recent call last):
  File "/app/example/test/simple_good_test.py", line 54, in test_negate_bitwise
    self.assertEqual(self.simple.negate_bitwise(1), -2)
AssertionError: 1 != -2

   - [#  43] LOR simple: 
--------------------------------------------------------------------------------
  74:     def bool_conjunction(self, a, b):
  75:         return (a or b)
  76:     
  77:     def bitwise_conjunction(self, a, b):
- 78:         return a | b
+ 78:         return a & b
  79:     
  80:     def foo(self):
  81:         return 2
  82:     
--------------------------------------------------------------------------------
<TIMESTAMP> killed by test_bitwise_conjunction (simple_good_test.SimpleGoodTest.test_bitwise_conjunction)

Traceback (most recent call last):
  File "/app/example/test/simple_good_test.py", line 60, in test_bitwise_conjunction
    self.assertEqual(self.simple.bitwise_conjunction(1, 0), 1)
AssertionError: 0 != 1

   - [#  44] ROR simple: 
--------------------------------------------------------------------------------
  30:     
  31:     def loop(self):
  32:         i = 0
  33:         
- 34:         while i != 100:
+ 34:         while i == 100:
  35:             i += 1
  36:         
  37:         return i
  38:     
--------------------------------------------------------------------------------
<TIMESTAMP> killed by test_loop (simple_good_test.SimpleGoodTest.test_loop)

Traceback (most recent call last):
  File "/app/example/test/simple_good_test.py", line 23, in test_loop
    self.assertEqual(self.simple.loop(), 100)
AssertionError: 0 != 100

   - [#  45] SCD simple: 
--------------------------------------------------------------------------------
  80:     def foo(self):
  81:         return 2
  82:     
  83:     def bar(self):
- 84:         super().bar()
+ 84:         pass
  85:         self.x += 1
  86:     
  87:     def handle_exception(self):
  88:         try:
--------------------------------------------------------------------------------
<TIMESTAMP> killed by test_overridden_call (simple_good_test.SimpleGoodTest.test_overridden_call)

Traceback (most recent call last):
  File "/app/example/test/simple_good_test.py", line 66, in test_overridden_call
    self.simple.bar()
  File "simple", line 85, in bar
AttributeError: 'Simple' object has no attribute 'x'
